Revit 2027 API
AdvancedLayered.LayeredRoughness Property
 The property labeled "Roughness" from the "AdvancedLayered" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string LayeredRoughness { get; }
Public Shared ReadOnly Property LayeredRoughness As String
	Get
public:
static property String^ LayeredRoughness {
	String^ get ();
}
static member LayeredRoughness : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble". This property allows a connected asset.
See Also
Reference
AdvancedLayered Class
Autodesk.Revit.DB.Visual Namespace